[{"title":"Croque Madame","ingredients":["salted butter, softened, divided","all-purpose flour","milk","shredded Gruyère cheese","salt, or to taste","ground black pepper, or to taste","ground nutmeg","white bread, lightly toasted","Dijon mustard","Black Forest ham","eggs","water","chopped fresh dill, or to taste (Optional)"],"preparationStep":["Set an oven rack about 6 inches from the heat source and preheat the oven's broiler.","Melt 1 1/2 tablespoons butter in a saucepan over medium-low heat. Whisk in flour and stir until slightly brown, about 3 minutes. Whisk in milk; bring to a boil, stirring constantly. Once boiling, reduce heat immediately and simmer for 5 minutes. Add 1/2 of the Gruyère cheese, salt, pepper, and nutmeg; heat until cheese is melted, about 2 minutes. Remove from the heat and set aside.","Spread about 1 teaspoon butter on 2 pieces of bread. Spread 1 tablespoon cheese sauce on top and layer each with a ham slice. Spread 1 teaspoon butter on the remaining 2 pieces of bread, then spread Dijon mustard on top and sprinkle with remaining Gruyère. Transfer all 4 pieces to a baking sheet.","Broil in the preheated oven until cheese is almost melted, 2 to 3 minutes. Remove from the oven, place toast slices together to make 2 sandwiches and pour remaining cheese sauce on top of each sandwich. Return to the broiler until sauce starts to brown, about 2 minutes.","While the sandwiches are broiling, heat remaining butter in a nonstick skillet over medium-high heat. Crack 2 eggs into the skillet, keeping them completely separate from one another. Season with salt and pepper. Add water, cover, and baste until whites are set but yolks are still runny, about 2 minutes.","Top each sandwich with an egg and sprinkle with dill, if using. Serve immediately."]},{"title":"Delicious Egg Salad","ingredients":["eggs","mayonnaise","chopped green onion","prepared yellow mustard","paprika","salt and pepper to taste"],"preparationStep":["Place eggs in a saucepan and cover with cold water. Bring water to a boil and immediately remove from heat. Cover and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, cool, peel, and chop.","Place chopped eggs in a bowl; stir in mayonnaise, green onion, and mustard. Season with paprika, salt, and pepper. Stir and serve on your favorite bread, crackers, or salad greens."]},{"title":"Sloppy Joes","ingredients":["lean ground beef","chopped onion","chopped green bell pepper","ketchup, or to taste","brown sugar, or to taste","yellow mustard, or to taste","garlic powder","salt and ground black pepper to taste","hamburger buns, split"],"preparationStep":["Heat a large skillet over medium heat. Cook and stir lean ground beef in the hot skillet until some of the fat starts to render, 3 to 4 minutes. Add onion and bell pepper; continue to cook until vegetables have softened and beef is cooked through, 3 to 5 more minutes.","Stir in ketchup, brown sugar, mustard, and garlic powder; season with salt and pepper. Reduce heat to low and simmer for 20 to 30 minutes.","Divide meat mixture evenly among hamburger buns."]},{"title":"Pasta Salad","ingredients":["tri-colored spiral pasta","Italian-style salad dressing","salad seasoning mix","cherry tomatoes, diced","green bell pepper, chopped","red bell pepper, diced","yellow bell pepper, chopped","black olives, chopped"],"preparationStep":["Gather all ingredients.","Dotdash Meredith Food Studios","Bring a large pot of lightly salted water to a boil. Cook pasta in the boiling water, stirring occasionally, until tender yet firm to the bite, about 10 to 12 minutes; rinse under cold water and drain.","Whisk Italian dressing and salad spice mix together until smooth. Combine pasta, tomatoes, bell peppers, and olives in a salad bowl.","Dotdash Meredith Food Studios","Pour dressing over salad and toss to coat.","Dotdash Meredith Food Studios","Refrigerate salad, 8 hours to overnight.","Dotdash Meredith Food Studios","Enjoy!","DOTDASH MEREDITH FOOD STUDIOS"]},{"title":"Best Cream Of Broccoli Soup","ingredients":["butter, divided","onion, chopped","celery, chopped","chicken broth","broccoli florets","all-purpose flour","milk","ground black pepper to taste"],"preparationStep":["Gather all ingredients.","Dotdash Meredith Food Studios","Melt 2 tablespoons butter in a medium stock pot over medium heat. Saute onion and celery until tender.","Dotdash Meredith Food Studios","Add broccoli and broth, cover, and simmer for 10 minutes.","Dotdash Meredith Food Studios","Pour the soup into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Puree in batches until smooth and pour into a clean pot. Alternately, you can use an immersion blender and puree the soup right in the cooking pot.","Dotdash Meredith Food Studios","Melt 3 tablespoons butter in a small saucepan over medium to medium-low heat; stir in flour and add milk. Stir until thick and bubbly, and add to soup. Season with pepper and serve.","Dotdash Meredith Food Studios","Serve hot and enjoy!","Allrecipes Magazine"]},{"title":"Old-Fashioned Potato Salad","ingredients":["potatoes","eggs","chopped celery","chopped onion","sweet pickle relish","mayonnaise","prepared mustard","garlic salt","celery salt","ground black pepper to taste"],"preparationStep":["Gather all ingredients.","Dotdash Meredith Food Studios","Bring a large pot of salted water to a boil. Add potatoes and cook until tender but still firm, about 15 minutes.","Drain, cool, peel, and chop potatoes.","Dotdash Meredith Food Studios","While potatoes cook, place eggs in a saucepan and cover with cold water. Bring water to a boil; cover, remove from heat, and let eggs stand in hot water for 10 to 12 minutes.","Remove from hot water, cool, peel, and chop eggs.","Dotdash Meredith Food Studios","Combine the potatoes, eggs, celery, onion, relish, mayonnaise, mustard, garlic salt, celery salt, and pepper in a large bowl. Mix together well and refrigerate until chilled.","Dotdash Meredith Food Studios","Enjoy!","DOTDASH MEREDITH FOOD STUDIOS"]},{"title":"Grilled Cheese Sandwich","ingredients":["white bread","butter, divided","Cheddar cheese"],"preparationStep":["Preheat a nonstick skillet over medium heat. Generously butter one side of a slice of bread. Place bread butter-side down in the hot skillet; add 1 slice of cheese. Butter a second slice of bread on one side and place butter-side up on top of cheese.","Cook until lightly browned on one side; flip over and continue cooking until cheese is melted. Repeat with remaining 2 slices of bread, butter, and slice of cheese."]},{"title":"Fresh Tomato Soup","ingredients":["chopped fresh tomatoes","chicken broth","garlic","of onion","butter","all-purpose flour","white sugar, or to taste","salt, or to taste"],"preparationStep":["Gather all ingredients.","Dotdash Meredith Food Studios","Combine tomatoes, chicken broth, garlic cloves, and a large slice of onion in a stockpot over medium heat. Bring to a boil, and gently simmer for about 20 minutes to blend flavors.","Dotdash Meredith Food Studios","Dotdash Meredith Food Studios","Remove from heat and run the mixture through a food mill into a large bowl, or pan. Discard any stuff left over in the food mill.","Dotdash Meredith Food Studios","Melt butter over medium heat in the now empty stockpot. Stir in flour to make a roux by cooking, whisking constantly, until mixture turns medium brown.","Dotdash Meredith Food Studios","Gradually whisk in a bit of the tomato mixture to prevent lumps from forming, then stir in the rest.","Dotdash Meredith Food Studios","Season with sugar and salt to taste.","Dotdash Meredith Food Studios","Serve hot and enjoy!","DOTDASH MEREDITH FOOD STUDIOS"]},{"title":"Marinated Cucumber, Onion, and Tomato Salad","ingredients":["water","distilled white vinegar","vegetable oil","sugar","salt, or to taste","freshly ground black pepper, or to taste","cucumbers, peeled and sliced 1/4-inch thick","tomatoes, cut into wedges","onion, sliced and separated into rings"],"preparationStep":["Gather all ingredients.","Dotdash Meredith Food Studios","Whisk water, vinegar, oil, sugar, salt, and pepper together in a large bowl until smooth.","Dotdash Meredith Food Studios","Add cucumbers, tomatoes, and onion and stir to coat.","Dotdash Meredith Food Studios","Cover bowl with plastic wrap; refrigerate for at least 2 hours.","Dotdash Meredith Food Studios","Enjoy!","DOTDASH MEREDITH FOOD STUDIOS"]},{"title":"Reuben Sandwich","ingredients":["rye bread","Thousand Island dressing","Swiss cheese","deli sliced corned beef","sauerkraut, drained","butter, softened"],"preparationStep":["Gather all ingredients and preheat a large griddle or skillet over medium heat.","Dotdash Meredith Food Studios","Spread one side of bread slices evenly with Thousand Island dressing.","Dotdash Meredith Food Studios","On four bread slices, layer one slice Swiss cheese, 2 slices corned beef, 1/4 cup sauerkraut, and a second slice of Swiss cheese. Top with remaining bread slices, dressing-side down. Butter the top of each sandwich.","Dotdash Meredith Food Studios","Place sandwiches, butter-side down on the preheated griddle; butter the top of each sandwich with remaining butter. Grill until both sides are golden brown, about 5 minutes per side.","Dotdash Meredith Food Studios","Serve hot. Enjoy!","Dotdash Meredith Food Studios"]},{"title":"Best Chicken Salad","ingredients":["blanched slivered almonds","mayonnaise","lemon juice","ground black pepper","chopped, cooked chicken meat","celery, chopped"],"preparationStep":["Gather all ingredients.","Dotdash Meredith Food Studios","Place almonds in a frying pan. Toast over medium-high heat, shaking frequently. Watch carefully, as they burn easily.","Dotdash Meredith Food Studios","Mix together mayonnaise, lemon juice, and pepper in a medium bowl.","Dotdash Meredith Food Studios","Dotdash Meredith Food Studios","Toss with chicken, toasted almonds, and celery.","Dotdash Meredith Food Studios","Dotdash Meredith Food Studios","Enjoy!","Dotdash Meredith Food Studios"]},{"title":"Simple Salami Sandwich","ingredients":["hoagie bun, toasted and split","yellow mustard","salami","Colby-Jack cheese","tomato","red leaf lettuce","sliced ripe olives, drained","sliced green olives with pimiento","zesty Italian-style salad dressing"],"preparationStep":["Place bottom bun on a plate and spread mustard over the bun. Top with salami, cheese, tomato, and lettuce leaf.","Combine black olives, green olives, and salad dressing in a bowl. Place mixture on top of the lettuce. Top with remaining half of bun. Serve immediately."]},{"title":"Salami, Ham, and Pepperoni Sandwiches in the Air Fryer","ingredients":["fresh mushrooms, sliced","basil pesto, divided","hoagie roll, split lengthwise","deli sliced salami","deli ham","pepperoni","provolone cheese, divided","sliced ripe black olives"],"preparationStep":["Place mushrooms in the basket of the air fryer. Set air fryer to 350 degrees F (175 degrees C) and cook mushroom slices for 5 minutes.","Spread 1 tablespoon pesto onto the bottom half of the hoagie bun. Arrange salami slices over the pesto. Add ham and pepperoni.","Place 1 slice of cheese over the ham and pepperoni. Top with mushrooms and olives. Add remaining slice of cheese. Spread remaining tablespoon of pesto on the other half of the bun and place on top to complete the sandwich.","Place entire sandwich in the basket of the air fryer. Cook until cheese has melted and salami is crisp, about 5 minutes."]},{"title":"Old Fashioned Pea Salad","ingredients":["frozen peas, thawed","onion, finely chopped","hard-cooked eggs, chopped","mayonnaise","salt and ground black pepper to taste"],"preparationStep":["Combine peas, onion, hard-cooked eggs, and mayonnaise in a large bowl. Stir well to combine. Season with salt and pepper. Chill for one hour before serving."]},{"title":"Egg Butter","ingredients":["eggs","butter","cayenne pepper","Worcestershire sauce"],"preparationStep":["Place the eggs into a saucepan in a single layer and fill with water to cover the eggs by 1 inch. Cover the saucepan and bring the water to a boil over high heat. Once the water is boiling, remove from the heat and let the eggs stand in the hot water for 15 minutes. Cool the eggs under cold running water. Peel, and remove yolks from white. Chop yolks; reserve whites for another use.","Beat butter in a large bowl until soft and fluffy. Mix in the egg yolks, cayenne pepper, and Worcestershire sauce. Beat until smooth."]},{"title":"Cucumber Soup with Tomatoes","ingredients":["cucumbers - peeled, quartered, and seeded","chicken broth","chopped tomato","fresh lime juice","cayenne pepper"],"preparationStep":["Place 2 cucumbers in a blender; pour in chicken stock. Blend cucumber mixture until smooth and pureed; pour cucumber puree into a large bowl.","Chop the remaining 2 cucumbers. Stir chopped cucumbers, tomato, lime juice, and cayenne pepper into pureed cucumber until well mixed. Refrigerate until chilled, at least 30 minutes."]},{"title":"Sugar Salad","ingredients":["vegetable oil","apple cider vinegar","white sugar","green leaf lettuce, torn into bite-size pieces"],"preparationStep":["Whisk the vegetable oil, vinegar, and sugar in a small bowl. Place the lettuce in a large bowl. Drizzle the oil mixture over the lettuce and toss to coat."]},{"title":"Yeast Dumplings","ingredients":["butter","milk","active dry yeast","water","eggs","sugar","salt","all-purpose flour","chicken broth"],"preparationStep":["Place milk and butter in a small saucepan, and simmer over medium heat until butter melts. Remove from the heat and allow to cool.","Dissolve the yeast in the warm water placed in a small bowl. Set aside.","Combine the eggs, sugar, and salt in a large mixing bowl, and mix until thoroughly blended. Gradually stir in the flour, alternating with milk and yeast mixtures. Gather the dough into a ball. Cover the bowl with a cloth, and let the dough rest 20 minutes.","Pour the chicken broth into a large pot. Bring broth to a boil over medium-high heat.","Meanwhile, sprinkle flour over a clean board or countertop. Turn the dough out onto the board and knead lightly until smooth and satiny, about 3 minutes. Add a little more flour if the dough is sticky. Roll out the dough to be about 1/2 inch thick. Use a butter knife to cut dough into 2 inch wide strips, and place strips into the boiling broth. Dumplings will initially sink, then rise to the surface when cooked, about 10 minutes. Remove dumplings from the broth with a slotted spoon, and drain on a plate."]},{"title":"Po' Boy Remoulade Sauce","ingredients":["mayonnaise","Creole or spicy brown mustard","ketchup","chopped fresh chives","minced fresh parsley","minced garlic","Worcestershire sauce","freshly squeezed lemon juice","ground paprika","cayenne pepper, or to taste","salt and ground black pepper to taste"],"preparationStep":["Mix mayonnaise, mustard, ketchup, chives, parsley, garlic, Worcestershire sauce, lemon juice, paprika, cayenne, salt, and pepper together until well combined."]},{"title":"The Ultimate Pasta Salad","ingredients":["uncooked tri-colored spiral pasta","fresh broccoli, cut into bite size pieces","fresh cauliflower, chopped into bite size pieces","red onion, chopped","minced garlic","pepperoni slices, cut into quarters","mozzarella cheese, cut into cubes","large pitted black olives, drained and sliced","olive oil, or to taste","red wine vinegar, or to taste","salt and pepper to taste","Italian seasoning to taste"],"preparationStep":["Bring a large pot of lightly salted water to a boil. Place pasta in the pot; cook until al dente, 8 to 10 minutes. Drain and transfer to a bowl. Cover and chill in the refrigerator for 1 hour.","Toss chilled pasta with broccoli, cauliflower, red onion, garlic, pepperoni, mozzarella cheese, olives, olive oil, and red wine vinegar. Season with salt, pepper, and Italian seasoning. Chill in the refrigerator until serving."]},{"title":"Tomato Gorgonzola Soup","ingredients":["olive oil","red onion, diced","red bell pepper, diced","cloves garlic, minced","Gorgonzola cheese, crumbled","cream cheese, softened","heavy cream","milk","diced tomatoes","tomato juice","dried basil","white sugar","ground white pepper"],"preparationStep":["Heat oil in a medium saucepan over medium heat. Add the onion, pepper, and garlic; cook and stir 4 to 5 minutes or until vegetables are soft.","Add the cheeses, cream, and milk; heat mixture until cheeses melt and the mixture is simmering.","Stir in the tomatoes (including their liquid), tomato juice, basil, sugar, and pepper. Continue to simmer mixture for 15 to 20 minutes while stirring constantly. Do not boil."]},{"title":"ESER's Balsamic Salad Dressing","ingredients":["balsamic vinegar","honey, or more to taste","Dijon mustard","garlic, crushed","dried oregano","salt and ground black pepper to taste","olive oil, or more as needed"],"preparationStep":["Combine balsamic vinegar, honey, mustard, garlic, oregano, salt, and black pepper in a food processor. Turn the food processor on; pour olive oil in a steady stream into balsamic vinegar mixture until salad dressing is thick and creamy."]},{"title":"Belizean Chicken Stew","ingredients":["olive oil","skinless, boneless chicken breast halves","seasoned salt to taste","chicken broth","green cabbage, shredded","onion, chopped","chopped carrots","green bell pepper, chopped","celery, chopped","chopped cilantro","tomato sauce","limes, juiced","garlic, minced","hot sauce (such as Marie Sharp's Belizean Habanero Sauce), or to taste","salt and ground black pepper to taste"],"preparationStep":["Heat olive oil in a large Dutch oven over medium heat. Season chicken with seasoned salt. Cook chicken in the hot oil until browned on the outside, about 5 minutes per side.","Mix chicken broth, cabbage, onion, carrots, green bell pepper, celery, cilantro, tomato sauce, lime juice, garlic, hot sauce, salt, and black pepper into chicken and simmer, adding water if needed, until stew is thickened, about 2 hours.","Ladle stew into bowls and top each with a piece of chicken."]},{"title":"Pizza Salad","ingredients":["iceberg lettuce, torn into bite-sized pieces","salami, cut into strips","shredded mozzarella cheese","shredded Cheddar cheese","tomato, chopped","pitted black olives, halved","chopped fresh chives","tomato sauce","vegetable oil","white wine vinegar","white sugar","dried oregano","salt","garlic powder","ground black pepper"],"preparationStep":["Combine lettuce, salami, mozzarella cheese, Cheddar cheese, tomato, olives, and chives in a large bowl. Mix well to combine.","Make dressing: Whisk together tomato sauce, oil, vinegar, sugar, oregano, salt, garlic powder, and pepper in a medium bowl.","Pour enough dressing over lettuce mixture to coat; toss and serve."]},{"title":"Fruity Chili","ingredients":["tomato sauce","kidney beans, rinsed and drained","chili powder","white sugar","cayenne pepper (Optional)","ground beef","chili powder","white sugar","cayenne pepper (Optional)","cooking oil","red onion, chopped","banana pepper, chopped","apple - peeled, cored, and chopped","peach - peeled, pitted, and chopped"],"preparationStep":["Combine the tomato sauce, kidney beans, 2 tablespoons chili powder, 1 tablespoon sugar, and cayenne pepper in a large sauce pan; bring to a simmer over low heat.","Place a large skillet over medium-high heat; place the ground beef in the skillet; season with 2 tablespoons chili powder, 1 tablespoon sugar, and the cayenne pepper; cook until brown; add to the sauce mixture.","Heat the oil in a small skillet over medium-high heat; cook the onion in the oil until slightly browned; add to the sauce mixture, along with the apple, peach, and banana pepper. Allow to simmer another 1 to 2 minutes until hot."]},{"title":"Summer Pepper Salad","ingredients":["green bell pepper, seeded and chopped","red bell pepper, seeded and chopped","yellow bell pepper, seeded and chopped","cucumber, seeded and chopped","chopped fresh parsley","crumbled feta cheese","olive oil"],"preparationStep":["In a large bowl, mix the green bell pepper, red bell pepper, yellow bell pepper, cucumber, parsley, feta cheese, and olive oil. Chill at least 30 minutes in the refrigerator before serving."]},{"title":"Grandma's Chicken Soup","ingredients":["whole chicken","carrots, peeled and sliced","celery, sliced","tomatoes, seeded and chopped","onion, chopped","fresh dill","kosher salt","ground black pepper","warm water as needed"],"preparationStep":["Clean chicken and remove some, but not all, fat. Place in a 2-quart soup pot with carrots, celery, tomatoes, and onion. Tie all dill sprigs into a bunch with kitchen string; add to the pot with salt and pepper. Add water until chicken is covered by 2 inches.","Cook over medium-low heat until chicken is just about cooked through, about 3 hours. Remove chicken to a platter and allow to cool slightly, 15 to 20 minutes. Cut meat off the bones, place meat back into the pot, and discard the bones. Cook over medium-low heat until heated through, about 30 minutes longer. Remove dill before serving."]},{"title":"Campfire Bread on a Stick","ingredients":["all-purpose flour","white sugar","vegetable oil","active dry yeast","salt","water, or as needed"],"preparationStep":["Combine flour, sugar, oil, yeast, and salt in a large bowl. Add 1 cup of water and start kneading. Continue kneading and adding water until you get an even dough that is very slightly sticky.","Knead a further 10 minutes, or longer if you have the time and patience. Cover dough and let rise in a warm area until it has doubled in volume, about 1 hour. (The dough can be baked when it has doubled its volume).","Have a few longish sticks or branches ready, about the thickness of a hotdog. Tear off a fistful of dough, roll it into a ball, then flatten it into a 4-inch round. Roll the dough around the end of the stick, so the edges will overlap.","Put the dough end of the stick in the campfire. Try to find a hot area that is not actually burning. Cook, turning every so often, until the bread is dark on the outside and slides easily off the stick, about 10 minutes."]},{"title":"Super-Delicious Zuppa Toscana","ingredients":["bulk mild Italian sausage","crushed red pepper flakes","bacon, cut into 1/2 inch pieces","onion, diced","minced garlic","chicken broth","potatoes, thinly sliced","heavy cream","fresh spinach, tough stems removed"],"preparationStep":["Cook Italian sausage and red pepper flakes in a Dutch oven over medium-high heat until crumbly, browned, and no longer pink, 10 to 15 minutes. Drain and set aside.","Cook bacon in the same Dutch oven over medium heat until crisp, about 10 minutes. Drain, leaving a few tablespoons of drippings with the bacon in the bottom of the Dutch oven. Stir in onions and garlic; cook until onions are soft and translucent, about 5 minutes.","Stir in chicken broth and bring to a boil over high heat. Add potatoes and simmer until fork tender, about 20 minutes. Reduce heat to medium; stir in cream, cooked sausage, and spinach. Cook and stir until spinach has wilted and sausage is warmed through; serve."]},{"title":"Ukrainian Red Borscht Soup","ingredients":["pork sausage","beets, peeled and shredded","carrots, peeled and shredded","baking potatoes, peeled and cubed","cabbage, cored and shredded","diced tomatoes, drained","vegetable oil","onion, chopped","tomato paste","water, divided, or as needed","garlic, minced","white sugar, or to taste","salt and pepper to taste","sour cream, for topping","freshly chopped dill or parsley for garnish"],"preparationStep":["Gather all ingredients.","Dotdash Meredith Food Studios","Crumble sausage into a skillet set over medium-high heat. Cook and stir until no longer pink. Remove from the heat and set aside.","Dotdash Meredith Food Studios","Fill a large pot halfway with water (about 8 cups) and bring to a boil.","Add sausage to pot, cover pot, and return to a boil. Add beets and simmer for 10 minutes. Add carrots and potatoes and continue to cook until potatoes are tender, about 10 minutes more. Stir in cabbage and tomatoes.","Dotdash Meredith Food Studios","Heat oil in a skillet over medium heat. Add onion and cook until tender. Stir in tomato paste and remaining 3/4 cup water until well blended; transfer to the pot.","Dotdash Meredith Food Studios","Add garlic to the soup, cover, and turn off the heat. Let stand 5 minutes. Stir in sugar and season with salt and pepper.","Dotdash Meredith Food Studios","Ladle into serving bowls. Garnish with sour cream and dill. Enjoy!","Dotdash Meredith Food Studios"]},{"title":"Baked Potato Soup","ingredients":["bacon","butter","all-purpose flour","milk","large baked potatoes, peeled and cubed","green onions, chopped","shredded Cheddar cheese","sour cream","salt","ground black pepper"],"preparationStep":["Gather all ingredients.","Dotdash Meredith Food Studios","Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 8 to 10 minutes. Drain bacon slices on paper towels; crumble and set aside.","Dotdash Meredith Food Studios","Meanwhile, melt butter in a stockpot or Dutch oven over medium heat. Gradually add flour, whisking until well-combined. Slowly pour in milk, whisking constantly until smooth and thickened.","Dotdash Meredith Food Studios","Add potatoes and onions and bring to a boil, stirring frequently. Reduce heat and simmer for 10 minutes.","Dotdash Meredith Food Studios","Stir in crumbled bacon, Cheddar cheese, sour cream, salt, and pepper. Continue cooking and stirring until cheese is melted.","Dotdash Meredith Food Studios","Enjoy!","Dotdash Meredith Food Studios"]},{"title":"Homemade Corn Dogs","ingredients":["yellow cornmeal","all-purpose flour","white sugar","baking powder","salt","black pepper","milk","egg","vegetable oil for frying","beef frankfurters","16 wooden skewers"],"preparationStep":["Combine cornmeal, flour, sugar, baking powder, salt, and pepper in a medium bowl; stir in milk and egg to make a batter.","Heat oil in a deep fryer or large saucepan to 375 degrees F (190 degrees C). Meanwhile, pat frankfurters dry and insert a skewer into each one. Roll frankfurters in batter until well coated.","Fry 2 or 3 corn dogs at a time in preheated oil until lightly browned, about 3 minutes. Drain on paper towels.","France C"]},{"title":"Caldo de Pollo","ingredients":["chicken leg quarters","water","minced garlic","salt","garlic powder","chicken bouillon","carrots, peeled and cut into large chunks","potatoes, peeled and cut into large chunks","zucchini, cut into large chunks","chayote, cut into large chunks","white onion, cut into large chunks","fresh cilantro, chopped"],"preparationStep":["Gather the ingredients.","Dotdash Meredith Food Studios","Place chicken legs into a large stockpot; pour water over chicken. Add minced garlic, salt, and garlic powder.","Dotdash Meredith Food Studios","Cover and bring to a boil over high heat. Reduce to a simmer and cook until chicken meat falls off the bones, 1 to 2 hours.","Dotdash Meredith Food Studios","Stir in chicken bouillon cube until dissolved; add carrots, potatoes, zucchini, chayote, and white onion. Reduce heat to medium-low and simmer until carrots and potatoes are tender, 45 minutes to 1 hour.","Dotdash Meredith Food Studios","Stir chopped cilantro into soup. Simmer for 5 minutes.","Dotdash Meredith Food Studios","Serve hot and enjoy!","Dotdash Meredith Food Studios"]},{"title":"Chef John's Creamy Mushroom Soup","ingredients":["unsalted butter","sliced fresh mushrooms","salt","yellow onion, diced","all-purpose flour","fresh thyme, tied in a bundle with kitchen twine","garlic, peeled","chicken broth, or more to taste","water, or more to taste","heavy whipping cream","salt and freshly ground black pepper to taste","fresh thyme leaves for garnish, or to taste"],"preparationStep":["Gather all ingredients.","Dotdash Meredith Food Studios","Melt butter in a large soup pot over medium-high heat. Sauté mushrooms and 1 pinch salt in the melted butter until mushrooms release their juices, 5 to 10 minutes. Reduce heat to medium-low and continue to cook, stirring often, until juices evaporate and mushrooms are caramelized, 15 to 25 minutes. Set aside a few attractive mushroom slices for garnish later, if desired.","Add onion to the mushrooms; cook until onion is soft and translucent, about 5 minutes.","Dotdash Meredith Food Studios","Stir flour into the mushroom mixture and cook, stirring often, to remove the raw flour taste, about 2 minutes.","Add thyme bundle and garlic cloves, then pour in 4 cups chicken broth and 1 cup water. Reduce heat to low and simmer for 1 hour. Remove and discard thyme bundle.","Dotdash Meredith Food Studios","Purée soup with a blender in batches until smooth and thick.","Dotdash Meredith Food Studios","Dotdash Meredith Food Studios","Stir in cream. If too thick, add a little chicken broth or water. Season with salt and black pepper.","Dotdash Meredith Food Studios","Ladle into bowls, and garnish with reserved mushroom slices and thyme leaves.","DOTDASH MEREDITH FOOD STUDIOS"]},{"title":"Broccoli Cheese Soup","ingredients":["butter","onion, chopped","frozen chopped broccoli","chicken broth","processed cheese food, cubed","milk","garlic powder","cornstarch","water"],"preparationStep":["Melt butter in a stockpot over medium heat. Add onion and cook, stirring occasionally, until softened. Stir in broccoli. Add broth and simmer until broccoli is tender, 10 to 15 minutes.","Reduce heat; add cheese cubes and stir until melted. Stir in milk and garlic powder.","Stir cornstarch and water together in a small bowl until smooth. Stir into soup; cook, stirring frequently, until thick.","Yoly"]},{"title":"Pasta Salad with Homemade Dressing","ingredients":["uncooked tri-color rotini pasta","pepperoni sausage, diced","provolone cheese, cubed","red onion, very thinly sliced and cut into 1-inch pieces","cucumber, thinly sliced","chopped green bell pepper","chopped red bell pepper","pitted black olives, drained","minced fresh parsley","grated Parmesan cheese","olive oil","red wine vinegar","garlic, minced","dried basil","dried oregano","ground mustard seed","salt","ground black pepper"],"preparationStep":["Gather all ingredients.","Dotdash Meredith Food Studios","Bring a large pot of lightly salted water to a boil. Add rotini and cook until tender yet firm to the bite, 8 to 10 minutes. Drain, rinse with cold water, and drain again.","Transfer drained, cooked pasta to a large bowl. Add pepperoni, provolone cheese, red onion, cucumber, bell peppers, olives, parsley, and Parmesan cheese.","Dotdash Meredith Food Studios","Mix olive oil, vinegar, garlic, basil, oregano, ground mustard, salt, and pepper for dressing in a jar with a lid. Seal the jar, and shake until well combined.","Dotdash Meredith Food Studios","Dotdash Meredith Food Studios","Pour dressing over the pasta salad; toss until well coated. Serve immediately, or cover and chill in the refrigerator for up to 8 hours before serving.","DOTDASH MEREDITH FOOD STUDIOS"]},{"title":"Day-After-Thanksgiving Turkey Carcass Soup","ingredients":["picked-over turkey carcass","leftover stuffing","onion, peeled and diced","carrots, peeled and sliced","celery stalks, chopped","poultry seasoning","ground sage","bay leaves","chicken broth","water, or as needed (Optional)","garlic salt, or to taste","ground black pepper, to taste","(uncooked) regular long-grain white rice","frozen green peas"],"preparationStep":["Place turkey carcass in a large, deep pot. Add stuffing, onion, carrots, celery, poultry seasoning, sage, and bay leaves.","Dotdash Meredith Food Studios","Pour in chicken broth. Add additional water if needed to cover. Bring to a boil over medium-high heat. Reduce heat to medium and simmer, skimming off any foam, for about 1 hour.","Dotdash Meredith Food Studios","Remove carcass and any bones. Pick any meat off carcass and bones. Return meat to the pot and discard bones and skin.","Dotdash Meredith Food Studios","Season soup with garlic salt and pepper. Stir in rice and return to a boil over medium-high heat. Reduce heat to medium and simmer for 15 minutes.","Dotdash Meredith Food Studios","Stir in peas and continue to simmer until rice is tender, about 10 minutes more.","Dotdash Meredith Food Studios","Adjust seasonings to taste before serving.","Dotdash Meredith Food Studios","Serve hot and enjoy!","Dotdash Meredith Food Studios"]},{"title":"Philly Cheesesteak","ingredients":["salt","black pepper","paprika","chili powder","onion powder","garlic powder","dried thyme","dried marjoram","dried basil","beef sirloin, cut into thin 2 inch strips","vegetable oil","onion, sliced","green bell pepper, julienned","Swiss cheese, thinly sliced","hoagie rolls, split lengthwise"],"preparationStep":["Mix salt, pepper, paprika, chili powder, onion powder, garlic powder, thyme, marjoram, and basil together in a small bowl.","Place steak in a large bowl; sprinkle seasoning mixture over top and stir to coat.","Heat 1/2 of the oil in a skillet over medium-high heat. Add steak; cook and stir to the desired doneness. Transfer cooked steak to a plate.","Heat the remaining oil in the skillet. Add onion and green pepper; cook and stir until tender and caramelized.","Preheat the oven on the broiler setting.","Divide cooked beef between the bottoms of 4 rolls. Layer with onion and green pepper, then top with sliced cheese. Place on a cookie sheet.","Broil in the preheated oven until cheese is melted.","Cover with tops of rolls and serve."]},{"title":"Three Bean Salad","ingredients":["green beans","wax beans","kidney beans, drained and rinsed","onion, sliced into thin rings","white sugar, or to taste","distilled white vinegar","vegetable oil","salt","ground black pepper","celery seed"],"preparationStep":["Gather all ingredients.","Dotdash Meredith Food Studios","Mix together green beans, wax beans, kidney beans, onion, sugar, vinegar, vegetable oil, salt, pepper, and celery seed. Chill in refrigerator for at least 12 hours.","Dotdash Meredith Food Studios","Enjoy!","DOTDASH MEREDITH FOOD STUDIOS"]},{"title":"Slow Cooker Italian Beef","ingredients":["water","dry Italian-style salad dressing mix","dried oregano","dried basil","dried parsley","onion salt","garlic powder","bay leaf","salt","ground black pepper","rump roast"],"preparationStep":["Combine water, salad dressing mix, oregano, basil, parsley, onion salt, garlic powder, bay leaf, salt, and black pepper in a saucepan. Stir well, and bring to a boil.","Place rump roast in a slow cooker; pour hot herb mixture over the meat.","Cover and cook on Low for 10 to 12 hours, or on High for 4 to 5 hours. Remove bay leaf; shred beef with a fork and serve with some of the hot gravy."]},{"title":"Homemade Sloppy Joes","ingredients":["extra-lean ground beef","onion, diced","green pepper, diced","garlic, minced","water, divided","ketchup","brown sugar","Dijon mustard","salt, or to taste","ground black pepper","Worcestershire sauce","cayenne pepper, or to taste"],"preparationStep":["Place ground beef and onion in a large skillet over medium heat; cook and stir until beef is browned and crumbled, about 10 minutes.","Stir in green pepper and garlic; cook and stir until softened, 2 to 3 minutes. Add 1 cup water and stir, scraping the pan to dissolve any brown flavor bits from the bottom of the skillet.","Stir in ketchup, brown sugar, Dijon mustard, salt, black pepper, and Worcestershire sauce. Add remaining 1 cup water and bring mixture to a boil. Reduce heat to low and simmer, stirring occasionally, until liquid has evaporated and mixture is thick, about 40 minutes.","Season with salt, black pepper, Worcestershire sauce, and cayenne pepper."]},{"title":"Black Bean and Corn Salad","ingredients":["olive oil","fresh lime juice","garlic, minced","salt","ground cayenne pepper","black beans, rinsed and drained","frozen corn kernels","avocado - peeled, pitted and diced","red bell pepper, chopped","tomatoes, chopped","green onions, thinly sliced","chopped fresh cilantro"],"preparationStep":["Gather the ingredients.","Dotdash Meredith Food Studios","Place olive oil, lime juice, garlic, salt, and cayenne pepper in a small jar. Close the lid tightly and shake the jar until the dressing is well combined.","Dotdash Meredith Food Studios","Combine in a salad bowl beans, corn, avocado, bell pepper, tomatoes, green onions, and cilantro.","Dotdash Meredith Food Studios","Shake dressing again, pour over salad, and toss to coat.","Dotdash Meredith Food Studios","Enjoy!","Dotdash Meredith Food Studios"]},{"title":"Easy French Dip Sandwiches","ingredients":["hoagie rolls, split lengthwise","beef consomme","water","thinly sliced deli roast beef","provolone cheese"],"preparationStep":["Preheat the oven to 350 degrees F (175 degrees C).","Open hoagie rolls and lay them out on a baking sheet.","Dotdash Meredith Food Studios","Heat beef consommé and water in a medium saucepan over medium-high heat to make a rich beef broth.","Dotdash Meredith Food Studios","Place roast beef in broth and warm for 3 minutes.","Dotdash Meredith Food Studios","Arrange meat on hoagie rolls and top each roll with 2 slices of provolone.","Dotdash Meredith Food Studios","Bake sandwiches in the preheated oven until cheese melts, about 5 minutes.","Dotdash Meredith Food Studios","Dotdash Meredith Food Studios","Serve sandwiches with small bowls of warm broth for dipping.","DOTDASH MEREDITH FOOD STUDIOS"]},{"title":"Beet Salad with Goat Cheese","ingredients":["beets - scrubbed, trimmed, and cut in half","chopped walnuts","maple syrup","mixed baby salad greens","frozen orange juice concentrate","balsamic vinegar","extra-virgin olive oil","goat cheese"],"preparationStep":["Place beets into a saucepan; add enough water to cover. Bring to a boil, then cook for 20 to 30 minutes, until tender. Drain and cool, then cut into cubes.","Dotdash Meredith Food Studios","While beets are cooking, place walnuts in a skillet over medium-low heat. Heat until warm and starting to toast. Stir in maple syrup; cook and stir until evenly coated, then remove from heat and set aside to cool.","Dotdash Meredith Food Studios","To make the dressing: Whisk orange juice concentrate, balsamic vinegar, and olive oil together in a small bowl.","Dotdash Meredith Food Studios","Place a large helping of baby greens onto each of four salad plates, divide candied walnuts equally and sprinkle over greens. Place equal amounts of beets over greens and top with pieces of goat cheese. Drizzle dressing over each salad.","Dotdash Meredith Food Studios"]},{"title":"Sausage, Potato and Kale Soup","ingredients":["bulk Italian sausage","half-and-half","cubed potatoes","low-sodium chicken broth","whole milk","onion, chopped","dried oregano","red pepper flakes, or more to taste","ground black pepper","kale, torn into bite-sized pieces"],"preparationStep":["Gather all ingredients.","Dotdash Meredith Food Studios","Heat a large soup pot over medium-high heat. Crumble sausage into the pot; cook and stir until browned, about 10 minutes. Drain and discard grease.","Dotdash Meredith Food Studios","Stir half-and-half, potatoes, chicken broth, milk, onion, oregano, and pepper flakes into sausage, and bring to a boil. Reduce heat to low and simmer until potatoes are tender, about 30 minutes.","Dotdash Meredith Food Studios","Season with black pepper. Stir in kale; simmer until kale is tender, 10 to 15 more minutes.","Dotdash Meredith Food Studios","Serve and enjoy!","Dotdash Meredith Food Studios"]},{"title":"Authentic Russian Salad 'Olivye'","ingredients":["potatoes, peeled","carrot, or more to taste","whole eggs","pickles, cut into cubes","peas, drained","cubed fully cooked ham, or to taste","chopped fresh dill, or to taste (optional)","mayonnaise, or to taste"],"preparationStep":["Gather all ingredients. Bring a large pot of water to a boil.","Dotdash Meredith Food Studios","Add potatoes, bring to a boil, and cook for 5 to 10 minutes. Add carrots and whole eggs and continue boiling until potatoes are tender, 10 to 15 minutes.","Dotdash Meredith Food Studios","Drain and slightly cool mixture.","Dotdash Meredith Food Studios","Chop potatoes and carrot. Peel and chop eggs.","Dotdash Meredith Food Studios","Mix potatoes, carrot, eggs, pickles, peas, ham, and dill together in a large bowl.","Dotdash Meredith Food Studios","Stir in mayonnaise until salad is evenly coated.","Dotdash Meredith Food Studios"]},{"title":"Natasha's Chicken Burgers","ingredients":["extra-lean ground chicken","Italian-seasoned bread crumbs, divided","onion, finely grated","egg","garlic, minced","salt and ground black pepper to taste","olive oil"],"preparationStep":["Mix ground chicken, 1/4 cup bread crumbs, onion, egg, and garlic in a bowl. Season with salt and pepper.","Moisten hands and shape chicken mixture, 2 tablespoons at a time, into flat, oval-shaped patties.","Spread remaining 1/4 cup bread crumbs in a shallow dish. Dip patties in bread crumbs to coat.","Heat olive oil in a large skillet over medium-high heat.","Cook patties in hot oil until deeply browned on the bottoms, 5 to 6 minutes. Turn patties and cook until other sides are browned, 3 to 4 minutes more."]},{"title":"Hawaiian Ham and Cheese Sliders","ingredients":["cooking spray (such as Crisco®)","butter","onion, minced","Dijon mustard","poppy seeds","Worcestershire sauce, or more to taste","Hawaiian sweet rolls, split, or more as needed","sliced deli ham, or more as needed","Swiss cheese, or more as needed"],"preparationStep":["Preheat the oven to 350 degrees F (175 degrees C). Spray a 9x13-inch baking dish with cooking spray.","Melt butter in a saucepan over medium-low heat; cook and stir onion in the melted butter until softened, 5 to 10 minutes. Add mustard, poppy seeds, and Worcestershire sauce; cook and stir for 5 minutes.","Arrange the roll bottoms in the prepared baking dish. Spoon 2/3 of the onion mixture over top. Add ham and cheese to each roll. Place the roll tops over the cheese layer, then brush the remaining onion mixture over top. Cover the dish with aluminum foil.","Bake in the preheated oven for 15 minutes. Remove aluminum foil and bake until the roll tops are lightly browned, 5 to 10 minutes."]},{"title":"Easy Slow Cooker French Dip","ingredients":["rump roast","beer","condensed French onion soup","beef broth","French rolls","butter"],"preparationStep":["Gather all ingredients.","Dotdash Meredith Food Studios","Trim excess fat from rump roast and place in a slow cooker.","Dotdash Meredith Food Studios","Pour in beer, onion soup, and beef broth. Cover and cook on Low setting for 7 hours.","Dotdash Meredith Food Studios","Preheat the oven to 350 degrees F (175 degrees C).","Split French rolls and arrange them on a baking sheet; spread with butter. Warm in the preheated oven for 10 minutes, or until heated through.","Dotdash Meredith Food Studios","Meanwhile, remove rump roast from the slow cooker and thinly slice on the diagonal.","Dotdash Meredith Food Studios","Pile sliced beef onto heated rolls. Serve with sauce for dipping. Enjoy!","Dotdash Meredith Food Studios"]},{"title":"Taco Bell Seasoning Copycat","ingredients":["dried onion flakes","all-purpose flour","beef bouillon granules","garlic salt","ground cumin","paprika","chili powder","cayenne pepper","white sugar"],"preparationStep":["Gather all ingredients.","Dotdash Meredith Food Studios","Whisk together onion flakes, flour, bouillon granules, garlic salt, cumin, paprika, chili powder, cayenne pepper, and sugar in a bowl.","Dotdash Meredith Food Studios"]},{"title":"Caprese Salad with Balsamic Reduction","ingredients":["balsamic vinegar","honey","tomatoes, cut into 1/2-inch slices","fresh mozzarella cheese, cut into 1/4-inch slices","salt","ground black pepper","fresh basil leaves","extra-virgin olive oil"],"preparationStep":["Gather all ingredients. Stir balsamic vinegar and honey together in a small saucepan and place over high heat.","Dotdash Meredith Food Studios","Bring to a boil, reduce heat to low, and simmer until mixture has reduced to 1/3 cup, about 10 minutes. Set aside to cool.","Dotdash Meredith Food Studios","Arrange alternating slices of tomato and mozzarella decoratively on a serving platter.","Dotdash Meredith Food Studios","Sprinkle with salt and black pepper, tuck basil leaves around slices, and drizzle with olive oil and the balsamic reduction.","Dotdash Meredith Food Studios"]},{"title":"Italian Pasta Salad","ingredients":["tri-color rotini pasta","Italian salami, finely diced","green bell pepper, sliced","red bell pepper, sliced","red onion, chopped","sliced black olives","small fresh mozzarella balls (ciliegine)","Italian-style salad dressing","dry Italian-style salad dressing mix, or to taste","shredded Parmesan cheese"],"preparationStep":["Gather all ingredients.","Dotdash Meredith Food Studios","Bring a large pot of lightly salted water to a boil. Cook rotini pasta at a boil until tender yet firm to the bite, about 8 minutes. Drain and rinse with cold water until cool.","Dotdash Meredith Food Studios","Combine pasta, salami, bell peppers, onion, mozzarella balls, and olives in a large bowl. Add salad dressing and toss to coat.","Dotdash Meredith Food Studios","Season pasta salad with dry salad dressing mix and stir to combine.","Dotdash Meredith Food Studios","Sprinkle with Parmesan cheese before serving. Enjoy!","Dotdash Meredith Food Studios"]},{"title":"Slow Cooker Buffalo Chicken Sandwiches","ingredients":["skinless, boneless chicken breast halves","Buffalo wing sauce, divided","dry ranch salad dressing mix","butter","hoagie rolls, split lengthwise"],"preparationStep":["Gather all ingredients.","Dotdash Meredith Food Studios","Place chicken breasts into the slow cooker; pour in 3/4 of the wing sauce and ranch dressing mix.","Dotdash Meredith Food Studios","Cover and cook on Low for 6 to 7 hours.","Shred chicken in the cooker with two forks. Stir in butter.","Dotdash Meredith Food Studios","Pile shredded chicken and sauce onto hoagie rolls. Serve with remaining Buffalo sauce.","Dotdash Meredith Food Studios","Serve and enjoy!","Dotdash Meredith Food Studios"]},{"title":"The Denver Omelet","ingredients":["eggs","butter","diced smoked ham","diced onion","diced green bell pepper","salt and freshly ground black pepper to taste","shredded Cheddar cheese","cayenne pepper"],"preparationStep":["Beat eggs in a small bowl until just combined; do not overbeat.","Melt butter in a skillet over medium-high heat. Add ham, onion, and bell pepper; season with salt and pepper. Cook and stir until onions soften and ham begins to caramelize, about 5 minutes.","Reduce heat to medium-low and pour in eggs. Mix briefly with a spatula while shaking the pan to ensure ingredients are evenly distributed. Quickly run the spatula along edges of omelet. Sprinkle Cheddar cheese and cayenne pepper over omelet.","Cook, shaking the pan occasionally, until top is still wet but not runny, about 5 minutes. Use a spatula to fold omelet in half and transfer it to a plate."]},{"title":"Japanese Tamago Egg","ingredients":["eggs","prepared dashi stock","white sugar","mirin (Japanese sweet wine)","soy sauce","vegetable oil, or more as needed"],"preparationStep":["Beat eggs thoroughly in a bowl; whisk in dashi stock, sugar, mirin, and soy sauce until sugar has dissolved.","Lightly grease a nonstick skillet and heat over medium heat.","Pour a thin layer of egg mixture into the hot pan and swirl to coat the pan. Cook until egg layer is firm on the bottom but still slightly liquid on top, about 1 minute. Then lift up one edge using a spatula and roll up the egg layer. Push omelet roll to one side of the skillet. Oil the skillet again and pour in another thin layer of egg, lifting the first omelet roll up slightly to allow the egg to flow underneath; roll up the first omelet in the new layer of egg and push omelet to the edge of the skillet as before. Repeat the process with the remaining egg mixture, oiling the pan each time if needed.","Remove rolled omelet to a serving platter and cut into 6 equal pieces to serve."]},{"title":"Sicilian Eggplant Caponata","ingredients":["eggplant, peeled and cut into ½-inch cubes","salt to taste","olive oil, divided","finely chopped celery","onion, finely chopped","garlic, minced","canned plum tomatoes, drained and coarsely chopped","green olives, pitted and coarsely chopped","drained capers","tomato paste","freshly minced oregano","red wine vinegar","white sugar","salt","ground black pepper to taste","minced fresh parsley, or to taste"],"preparationStep":["Toss eggplant with salt and place in a colander set over a bowl. Let sit, about 30 minutes. Rinse and pat dry.","Dotdash Meredith Food Studios","Heat 2 tablespoons olive oil in a large skillet over medium heat. Add celery; cook, stirring often, until softened, about 3 to 4 minutes. Add onion and garlic; cook and stir until onion is soft and lightly golden, about 4 to 5 minutes. Transfer the mixture to a bowl using a slotted spoon.","Dotdash Meredith Food Studios","Heat remaining 2 tablespoons olive oil in the skillet. Add eggplant and cook, stirring constantly, until lightly browned, 5 minutes.","Dotdash Meredith Food Studios","Stir in celery mixture, tomatoes, olives, capers, tomato paste, and oregano. Bring to a boil; reduce heat to low and simmer uncovered until caponata is thickened, about 15 minutes.","Dotdash Meredith Food Studios","Season caponata with vinegar, sugar, salt, and black pepper. Transfer to a serving bowl and garnish with parsley."]},{"title":"How to Make Tomato Bisque","ingredients":["olive oil","diced onion","diced celery","salt","garlic, chopped","chicken broth, or more as needed","crushed San Marzano tomatoes","paprika","freshly ground black pepper, or to taste","cayenne pepper, or to taste","uncooked jasmine rice","white sugar, or to taste","heavy whipping cream","salt and freshly ground black pepper to taste","heavy whipping cream, divided","thinly sliced fresh basil leaves, divided"],"preparationStep":["Gather all ingredients.","Dotdash Meredith Food Studios","Heat olive oil in a large pot over medium heat; cook and stir onion and celery with a pinch of salt until onion is translucent, 5 to 8 minutes. Stir in garlic and cook until fragrant, about 1 minute.","Dotdash Meredith Food Studios","Pour chicken broth and tomatoes into onion mixture. Bring to a simmer and season with paprika, black pepper, and cayenne pepper.","Dotdash Meredith Food Studios","Turn heat to low and stir rice into soup; skim foam occasionally and simmer until rice and vegetables are very tender, 35 to 45 minutes. Add sugar.","Dotdash Meredith Food Studios","Blend soup with an immersion blender in the pot until smooth.","Dotdash Meredith Food Studios","Whisk 1/2 cup cream into soup and season with salt, black pepper, cayenne pepper, and sugar if needed. If soup is too thick, add more broth; if soup is too thin, cook, stirring often, until reduced and slightly thickened, about 10 minutes.","Dotdash Meredith Food Studios","Ladle into warmed bowls; garnish each bowl with a drizzle of cream and top each with about 1 teaspoon chopped basil.","Dotdash Meredith Food Studios"]}]